# Taps
#tap 'homebrew/cask'
#tap 'homebrew/cask-eid' # cask removed from homebrew
# tap 'homebrew/cask-fonts' # cask removed from homebrew
# tap 'homebrew/cask-versions' # cask removed from homebrew
tap 'homebrew/bundle'
#tap 'drud/ddev'
tap 'nicoverbruggen/homebrew-cask'
tap 'fwartner/tap'
#tap 'espanso/espanso'

# Binaries
#brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'difftastic'
brew 'exiftool'
brew 'ffmpeg'
brew 'gh'
brew 'git'
#brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'lame'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'starship'
#brew 'stripe'
#brew 'svn'
brew 'macos-trash' # Manage the Trash bin
brew 'tailspin' # tspin log file highlighter to replace tail
brew 'tree' # List directories in a tree structure
brew 'z'
brew 'zlib' # Needed for Memcached
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# Development
brew 'php'
brew 'php@8.2'
brew 'php@8.1'
brew 'php@8.0'
brew 'php-code-sniffer'
brew 'php-cs-fixer'
brew 'brew-php-switcher'
brew 'composer'
#brew 'imagemagick'
#brew 'libmemcached'
brew 'fwartner/tap/mac-cleanup'
#brew 'memcached'
brew 'mysql'
brew 'nginx'
brew 'node'
# brew 'redis'
brew 'rustup-init'
brew 'sqlite'
brew 'svn'
brew 'yarn'
brew 'python'
brew 'pyenv'
brew 'pipenv'

# Apps
cask '1password'
cask '1password-cli'
#cask 'aerial'
#cask 'alfred'
cask 'audacity'
#cask 'bartender'
cask 'blackhole-16ch'
#cask 'caffeine'
cask 'db-browser-for-sqlite'
cask 'dbngin'
#cask 'discord'
cask 'docker'
#cask 'espanso'
cask 'evernote'
#cask 'figma'
cask 'firefox'
cask 'gimp'
cask 'github'
#cask 'google-backup-and-sync'
cask 'google-chrome'
#cask 'gpg-suite'
cask 'handbrake'
cask 'herd'
#cask 'imageoptim'
#cask 'insomnia'
cask 'iterm2'
#cask 'java'
cask 'julia'
cask 'krita'
cask 'macdown'
cask 'musescore'
cask 'mysqlworkbench'
cask 'namechanger'
cask 'notion'
cask 'sequel-ace'
#cask 'nvidia-geforce-now'
cask 'pgadmin4'
cask 'phpmon'
#cask 'phpstorm'
cask 'raycast'
#cask 'rectangle'
#cask 'screenflow'
cask 'signal'
cask 'skype'
#cask 'slack'
cask 'sourcetree'
cask 'spotify'
#cask 'steam'
#cask 'sublime-text'
cask 'tableplus'
#cask 'telegram-desktop'
cask 'the-unarchiver'
#cask 'tinkerwell'
#cask 'tor-browser'
#cask 'transmission'
#cask 'transmit'
#cask 'vagrant'
#cask 'virtualbox' # Might need to allow access in Security settings
#cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'zoom'
cask 'zotero'

# Docker setup (DDEV)
#brew 'ddev'

# Fonts
cask 'font-cascadia-code-pl'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-gentium-plus'
# cask 'font-gentium-book-plus'
cask 'font-inter'
cask 'font-lato'
cask 'font-menlo-for-powerline'
cask 'font-monaspace'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
#mas 'Byword', id: 420212497
#mas 'Giphy Capture', id: 668208984
#mas 'Keynote', id: 409183694
#mas 'Numbers', id: 409203825
#mas 'Spark', id: 1176895641
#mas 'Things', id: 904280696
#mas 'Tweetbot', id: 1384080005
