# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
#tap 'drud/ddev'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
#brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
#brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'lame'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'starship'
#brew 'stripe'
#brew 'svn'
brew 'macos-trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'z'
brew 'zlib' # Needed for Memcached
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# Development
brew 'php'
brew 'php@7.3'
brew 'php@7.2'
brew 'php-code-sniffer'
brew 'php-cs-fixer'
brew 'phplint'
brew 'brew-php-switcher'
brew 'composer'
#brew 'imagemagick'
#brew 'libmemcached'
#brew 'memcached'
brew 'mysql'
brew 'mysql@5.7'
#brew 'nginx'
brew 'node'
#brew 'redis'
brew 'sqlite'
brew 'svn'
brew 'yarn'

# Apps
cask '1password'
cask '1password-cli'
#cask 'aerial'
cask 'alfred'
#cask 'bartender'
#cask 'caffeine'
cask db-browser-for-sqlite
#cask 'dbngin'
#cask 'discord'
cask 'docker'
#cask 'figma'
cask 'firefox'
cask 'gimp'
cask 'github'
#cask 'google-backup-and-sync'
cask 'google-chrome'
#cask 'gpg-suite'
#cask 'imageoptim'
#cask 'insomnia'
cask 'iterm2'
#cask 'java'
cask 'macdown'
cask 'mysqlworkbench'
cask 'sequel-ace'
#cask 'nvidia-geforce-now'
cask 'phpmon'
#cask 'phpstorm'
#cask 'screenflow'
cask 'skype'
#cask 'slack'
cask 'sourcetree'
#cask 'steam'
#cask 'sublime-text'
#cask 'tableplus'
#cask 'telegram-desktop'
cask 'the-unarchiver'
#cask 'tinkerwell'
#cask 'tor-browser'
#cask 'transmission'
#cask 'transmit'
cask 'vagrant'
cask 'virtualbox' # Might need to allow access in Security settings
#cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'

# Docker setup (DDEV)
#brew 'ddev'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-cascadia'
cask 'font-menlo-for-powerline'

# Mac App Store
#mas 'Byword', id: 420212497
#mas 'Giphy Capture', id: 668208984
#mas 'Keynote', id: 409183694
#mas 'Numbers', id: 409203825
#mas 'Spark', id: 1176895641
#mas 'Things', id: 904280696
#mas 'Tweetbot', id: 1384080005
